# GetCustomHandleTag Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstrainedHandle..::..GetCustomHandleTag Method
RebarConstrainedHandle Class See Also
---
Returns the tag of the handle. The type of the handle should be 'CustomHandle'.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetCustomHandleTag()
```

Visual Basic
---
```text
Public Function GetCustomHandleTag As Integer
```

Visual C++
---
```text
public:
int GetCustomHandleTag()
```

# ### Return Value
Returns the tag of custom handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstrainedHandle is no longer valid. -or- The RebarConstrainedHandle is not of RebarHandleType 'CustomHandle'. |

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace